models/StudentForm.php

    public function addStudent()
    {
        if ($this->student_img) {
            $this->student_img->saveAs('uploads/' . $this->student_img->baseName . time() . '.' . $this->student_img->extension);
            $this->student_img = $this->student_img->baseName . time() . '.' . $this->student_img->extension;
        }
        return $this->save() ? true : false;
---
INSERT INTO `tbl_student` (`student_img`, `full_name`, `phone_no`, `email`, `dob`, `address`, `created_at`, `updated_at`, `created_by`) VALUES ('sign1701689458.jpg', 'sample sign', '8527410963', 'signdata@gmail.com', '2023-12-21', 'sign data', NOW(), NOW(), 1)

    public function updateStudent($id)
    {
        $student = $this->findOne(['id' => $id]);
        if ($this->student_img === 'removed') {
            $this->student_img = null;
        } elseif ($this->student_img === null) {
            $this->student_img = $student->student_img;
        } else {
            $this->student_img->saveAs('uploads/' . $this->student_img->baseName . time() . '.' . $this->student_img->extension);
---
SELECT * FROM `tbl_student` WHERE `id`='46'
UPDATE `tbl_student` SET `student_img`='among-us-minimal-colorful-space-5k-8k-amoled-7680x4320-40811701688618.png', `full_name`='No dyata', `address`='123', `updated_at`=NOW() WHERE `id`=46