models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::ACTIVE_USER]);
---
SELECT * FROM `tbl_user` WHERE (`id`=1) AND (`status`=1)